
===========================================================================
report_tns
============================================================================
tns -481.26

===========================================================================
report_wns
============================================================================
wns -21.19

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -21.19

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.30
