
===========================================================================
report_tns
============================================================================
tns -454.42

===========================================================================
report_wns
============================================================================
wns -454.42

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -454.42

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.22
